use meval::eval_str;
use rand::RngExt;
use chrono::{Local, Utc, Timelike};
use serenity::prelude::Context;
use serenity::all::{CreateMessage, CreateAttachment, CreateEmbed, CreateInteractionResponseMessage};
use std::env;
use std::sync::Arc;
use tokio::sync::Mutex;
use once_cell::sync::Lazy;
use sqlx::MySqlPool;
use reqwest::get;
use serde_json::Value;
use serde::Serialize;
use phf::phf_map;

static WEATHER_KEY: Lazy<String> = Lazy::new(|| env::var("WEATHER_KEY").expect("[EXPECT] env WEATHER_KEY"));

const TIME_KEYWORDS: &[&str] = &[
    "몇시야", "시간", "지금몇시야", "시간좀", "몇시", "날짜", "몇일",
    "WHATSTIME", "TIME", "WHATTIMEISIT", "GIVEMETIME", "DATE", "WHATS", "WHATSDATE", 
    "KST", "KOREANSTANDARDTIME", "KOREASTANDARDTIME"
];

const UTC_KEYWORDS: &[&str] = &[
    "UTC","협정시간", "협정세계시", "세계협정시계시", "COORDINATEDUNIVERSALTIME", "UNIVERSALTIMECOORDINATED"
];

#[derive(Clone, Serialize)]
pub struct Resp {
    pub values: Vec<String>,
    pub probs: Vec<String>,
}

pub struct RespStore {
    inner: Arc<Mutex<Vec<Resp>>>,
}

impl RespStore {
    pub fn new(initial: Vec<Resp>) -> Self {
        Self {
            inner: Arc::new(Mutex::new(initial)),
        }
    }

    pub fn shared(&self) -> Arc<Mutex<Vec<Resp>>> {
        self.inner.clone()
    }

    pub async fn update(&self, new_data: Vec<Resp>) {
        let mut guard = self.inner.lock().await;
        *guard = new_data;
    }
    
    pub async fn load_all(pool: &MySqlPool) -> Result<Vec<Resp>, sqlx::Error> {
        let rows = sqlx::query!(
            r#"
            SELECT
                value_json as `value_json!: String`,
                prob_json  as `prob_json!: String`
            FROM resp
            ORDER BY id
            "#
        )
        .fetch_all(pool)
        .await?;

        let mut out = Vec::with_capacity(rows.len());

        for row in rows {
            let values: Vec<String> =
                serde_json::from_str(&row.value_json).unwrap();
            let probs: Vec<String> =
                serde_json::from_str(&row.prob_json).unwrap();

            out.push(Resp { values, probs });
        }

        Ok(out)
    }
}

pub async fn db_new_key(
    pool: &MySqlPool,
    key: &str,
) -> Result<(), sqlx::Error> {
    let rows = sqlx::query!("SELECT value_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error: {}", e).into()))?;
            
        if values.contains(&key.to_string()) {
            return Err(sqlx::Error::Protocol("Key already exists".into()));
        }
    }

    let value_json = serde_json::to_string(&[key])
        .map_err(|e| sqlx::Error::Protocol(format!("Serialization error: {}", e).into()))?;
        
    let prob_json = "[]";

    sqlx::query!(
        "INSERT INTO resp (value_json, prob_json) VALUES (?, ?)",
        value_json,
        prob_json
    )
    .execute(pool)
    .await?;

    Ok(())
}

pub async fn db_add_resp(
    pool: &MySqlPool,
    key: &str,
    resp: &str,
) -> Result<(), sqlx::Error> {
    let rows = sqlx::query!("SELECT id, value_json, prob_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (value): {}", e).into()))?;

        if values.contains(&key.to_string()) {
            let mut probs: Vec<String> = serde_json::from_str(&r.prob_json)
                .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (prob): {}", e).into()))?;

            probs.push(resp.to_string());

            let new_probs_json = serde_json::to_string(&probs)
                .map_err(|e| sqlx::Error::Protocol(format!("Serialization error: {}", e).into()))?;

            sqlx::query!(
                "UPDATE resp SET prob_json = ? WHERE id = ?",
                new_probs_json,
                r.id
            )
            .execute(pool)
            .await?;

            return Ok(());
        }
    }

    Err(sqlx::Error::Protocol("Key not found".into()))
}

pub async fn db_add_resp_bulk(
    pool: &MySqlPool,
    key: &str,
    new_resps: &[String],
) -> Result<(), sqlx::Error> {
    let rows = sqlx::query!("SELECT id, value_json, prob_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (value): {}", e).into()))?;

        if values.contains(&key.to_string()) {
            let mut probs: Vec<String> = serde_json::from_str(&r.prob_json)
                .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (prob): {}", e).into()))?;

            probs.extend(new_resps.iter().cloned());

            let new_probs_json = serde_json::to_string(&probs)
                .map_err(|e| sqlx::Error::Protocol(format!("Serialization error: {}", e).into()))?;

            sqlx::query!(
                "UPDATE resp SET prob_json = ? WHERE id = ?",
                new_probs_json,
                r.id
            )
            .execute(pool)
            .await?;

            return Ok(());
        }
    }

    Err(sqlx::Error::Protocol("Key not found".into()))
}

pub async fn db_add_key(
    pool: &MySqlPool,
    key: &str,
    new_key: &str,
) -> Result<(), sqlx::Error> {
    let rows = sqlx::query!("SELECT id, value_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let mut values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error: {}", e).into()))?;

        if values.contains(&key.to_string()) {
            if values.contains(&new_key.to_string()) {
                return Err(sqlx::Error::Protocol("Duplicate key".into()));
            }

            values.push(new_key.to_string());
            let new_values_json = serde_json::to_string(&values)
                .map_err(|e| sqlx::Error::Protocol(format!("Serialization error: {}", e).into()))?;

            sqlx::query!(
                "UPDATE resp SET value_json = ? WHERE id = ?",
                new_values_json,
                r.id
            )
            .execute(pool)
            .await?;

            return Ok(());
        }
    }

    Err(sqlx::Error::Protocol("Original key not found".into()))
}

pub async fn db_add_key_bulk(
    pool: &MySqlPool,
    key: &str,
    new_keys: &[String],
) -> Result<(), sqlx::Error> {
    let rows = sqlx::query!("SELECT id, value_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let mut values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error: {}", e).into()))?;

        if values.contains(&key.to_string()) {
            if new_keys.iter().any(|k| values.contains(k)) {
                return Err(sqlx::Error::Protocol("Duplicate key in new keys".into()));
            }

            values.extend(new_keys.iter().cloned());
            
            let new_values_json = serde_json::to_string(&values)
                .map_err(|e| sqlx::Error::Protocol(format!("Serialization error: {}", e).into()))?;

            sqlx::query!(
                "UPDATE resp SET value_json = ? WHERE id = ?",
                new_values_json,
                r.id
            )
            .execute(pool)
            .await?;

            return Ok(());
        }
    }

    Err(sqlx::Error::Protocol("Original key not found".into()))
}

pub async fn db_get_table(
    pool: &MySqlPool,
    key: &str,
) -> Result<Option<Resp>, sqlx::Error> {
    let rows = sqlx::query!("SELECT id, value_json, prob_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (value): {}", e).into()))?;

        if values.contains(&key.to_string()) {
            let probs: Vec<String> = serde_json::from_str(&r.prob_json)
                .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (prob): {}", e).into()))?;
            
            return Ok(Some(Resp { values, probs }));
        }
    }

    Ok(None)
}

pub async fn db_remove_table(
    pool: &MySqlPool,
    key: &str,
    force: bool,
) -> Result<(), sqlx::Error> {
    // 1. 데이터 조회
    let rows = sqlx::query!("SELECT id, value_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error: {}", e).into()))?;

        if values.contains(&key.to_string()) {
            // 3. 비즈니스 로직 검증
            if values.len() > 1 && !force {
                return Err(sqlx::Error::Protocol(
                    "Cannot remove: multiple keys in this record (use force=true to override)".into(),
                ));
            }

            // 4. 데이터 삭제
            sqlx::query!("DELETE FROM resp WHERE id = ?", r.id)
                .execute(pool)
                .await?;

            return Ok(());
        }
    }

    Err(sqlx::Error::Protocol("Key not found".into()))
}

pub async fn db_remove_resp(
    pool: &MySqlPool,
    key: &str,
    targets: &str,
    multi: bool,
) -> Result<(), sqlx::Error> {
    let rows = sqlx::query!("SELECT id, value_json, prob_json FROM resp")
        .fetch_all(pool)
        .await?;

    for r in rows {
        let values: Vec<String> = serde_json::from_str(&r.value_json)
            .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (value): {}", e).into()))?;

        if values.contains(&key.to_string()) {
            let mut probs: Vec<String> = serde_json::from_str(&r.prob_json)
                .map_err(|e| sqlx::Error::Protocol(format!("JSON parse error (prob): {}", e).into()))?;

            if multi {
                probs.retain(|p| p != targets);
            } else if let Some(pos) = probs.iter().position(|p| p == targets) {
                probs.remove(pos);
            }

            if probs.is_empty() {
                sqlx::query!("DELETE FROM resp WHERE id = ?", r.id)
                    .execute(pool)
                    .await?;
            } else {
                let probs_json = serde_json::to_string(&probs)
                    .map_err(|e| sqlx::Error::Protocol(format!("Serialization error: {}", e).into()))?;
                    
                sqlx::query!("UPDATE resp SET prob_json = ? WHERE id = ?", probs_json, r.id)
                    .execute(pool)
                    .await?;
            }

            return Ok(());
        }
    }

    Err(sqlx::Error::Protocol("Key not found".into()))
}

pub async fn get_response(
    resp: &Arc<Mutex<Vec<Resp>>>,
    message: &str,
) -> Option<String> {
    
    /* ㅋ
    if message == "?" {
        if rand::rng().random_range(0..1000) == 1 {
            return Some("러스트에서 `?` 연산자는 주로 에러 처리를 간단하게 하고자 할 때 사용되며 특정 연산이 실패할 가능성이 있는 상황에서 Result 또는 Option 타입을 다루는 데 유용하지.\n`?`를 이용하면 함수 내부에서 발생한 에러를 간결하게 호출한 쪽으로 전달할 수 있어.\n좋아, 말이 길었던것 같아. 뭐 어쨌든 너가 극한의 확률을 뚫었어.\n축하해줄게 이건 나오기 정말 정말 어려워. 근데 넌 그걸 뚫은거고".to_string())
        } else {
            return None;
        }
    }
    */

    let normalized_q =
        message.replace(&[' ', '.', '!', ':', '-'][..], "");

    {
        let guard = resp.lock().await;

        if guard.is_empty() {
            return Some("DB가 비어있는데, 지금은 쓸 수 없을 것 같아.".to_string());
        }

        for r in guard.iter() {
            if r.values.iter().any(|kw| {
                kw.replace(&[' ', '.'][..], "")
                    .eq_ignore_ascii_case(&normalized_q)
            }) {
                let idx = if r.probs.len() > 1 {
                    rand::rng().random_range(0..r.probs.len())
                } else {
                    0
                };
                return Some(r.probs[idx].clone());
            }
        }
    }

    let normalized =
        message.replace(&[' ', '?', '!', '.', ':', '-'][..], "");

    for &keyword in UTC_KEYWORDS {
        if normalized == keyword {
            let utc = Utc::now().format("%Y-%m-%d %H:%M:%S");
            return Some(format!("UTC {}", utc));
        }
    }

    for &keyword in TIME_KEYWORDS {
        if normalized == keyword {
            let kst = Local::now().format("%Y-%m-%d %H:%M:%S");
            return Some(format!("KST {}", kst));
        }
    }

    {
        let guard = resp.lock().await;

        for r in guard.iter() {
            if r.values.iter().any(|kw| {
                kw.replace(&[' ', '?', '!', '.', ':', '-'][..], "")
                    .eq_ignore_ascii_case(&normalized)
            }) {
                let idx = if r.probs.len() > 1 {
                    rand::rng().random_range(0..r.probs.len())
                } else {
                    0
                };
                return Some(r.probs[idx].clone());
            }
        }
    }

    let evalmsg = message.replace(' ', "").to_lowercase();
    if let Ok(result) = eval_str(&evalmsg) {
        return Some(result.to_string());
    }

    None
}

const W_FACE: &[&str] = &["니얼굴", "URFACE"];
const W_MIDDLE: &[&str] = &["ㅗ", "MIDDLEFINGER"];
const W_BLUEPRINT: &[&str] = &["블루프린트","청사진","BLUEPRINT"];

const W_WEATHER_KEYWORDS: &[&str] = &["날씨","기상","기상청","WEATHER","WEATHERFORECAST","WEATHERREPORT"];
static W_WEATHER_REGIONS: phf::Map<&'static str, (u8, u8)> = phf_map! {
    "서울특별시종로구" => (60, 127),
    "서울종로구" => (60, 127),
    "서울특별시종로" => (60, 127),
    "서울특별시중구" => (60, 127),
    "서울중구" => (60, 127),
    "서울특별시중" => (60, 127),
    "서울용산구" => (60, 126),
    "서울특별시용산" => (60, 126),
    "서울특별시용산구" => (60, 126),
    "서울특별시성동구" => (61, 127),
    "서울성동구" => (61, 127),
    "서울특별시성동" => (61, 127),
    "서울광진구" => (62, 126),
    "서울특별시광진" => (62, 126),
    "서울특별시광진구" => (62, 126),
    "서울특별시동대문구" => (61, 127),
    "서울동대문구" => (61, 127),
    "서울특별시동대문" => (61, 127),
    "서울중랑구" => (62, 128),
    "서울특별시중랑구" => (62, 128),
    "서울특별시중랑" => (62, 128),
    "서울특별시성북구" => (61, 127),
    "서울성북구" => (61, 127),
    "서울특별시성북" => (61, 127),
    "서울특별시강북" => (61, 128),
    "서울강북구" => (61, 128),
    "서울특별시강북구" => (61, 128),
    "서울특별시도봉" => (61, 129),
    "서울특별시도봉구" => (61, 129),
    "서울도봉구" => (61, 129),
    "서울특별시노원" => (61, 129),
    "서울노원구" => (61, 129),
    "서울특별시노원구" => (61, 129),
    "서울특별시은평" => (59, 127),
    "서울은평구" => (59, 127),
    "서울특별시은평구" => (59, 127),
    "서울특별시서대문" => (59, 127),
    "서울특별시서대문구" => (59, 127),
    "서울서대문구" => (59, 127),
    "서울특별시마포" => (59, 127),
    "서울마포구" => (59, 127),
    "서울특별시마포구" => (59, 127),
    "서울특별시양천" => (58, 126),
    "서울특별시양천구" => (58, 126),
    "서울양천구" => (58, 126),
    "서울강서구" => (58, 126),
    "서울특별시강서" => (58, 126),
    "서울특별시강서구" => (58, 126),
    "서울특별시로" => (58, 125),
    "서울특별시구로구" => (58, 125),
    "서울구로구" => (58, 125),
    "서울금천구" => (59, 124),
    "서울특별시금천구" => (59, 124),
    "서울특별시금천" => (59, 124),
    "서울특별시영등포" => (58, 126),
    "서울영등포구" => (58, 126),
    "서울특별시영등포구" => (58, 126),
    "서울특별시동작구" => (59, 125),
    "서울특별시동작" => (59, 125),
    "서울동작구" => (59, 125),
    "서울특별시관악구" => (59, 125),
    "서울관악구" => (59, 125),
    "서울특별시관악" => (59, 125),
    "서울서초구" => (61, 125),
    "서울특별시서초구" => (61, 125),
    "서울특별시서초" => (61, 125),
    "서울특별시강남구" => (61, 126),
    "서울강남구" => (61, 126),
    "서울특별시강남" => (61, 126),
    "서울특별시송파" => (62, 126),
    "서울특별시송파구" => (62, 126),
    "서울송파구" => (62, 126),
    "서울특별시강동" => (62, 126),
    "서울특별시강동구" => (62, 126),
    "서울강동구" => (62, 126),
    "종로" => (60, 127),
    "종로구" => (60, 127),
    "중구" => (60, 127),
    "용산" => (60, 126),
    "용산구" => (60, 126),
    "성동" => (61, 127),
    "성동구" => (61, 127),
    "광진" => (62, 126),
    "광진구" => (62, 126),
    "동대문" => (61, 127),
    "중랑" => (62, 128),
    "중랑구" => (62, 128),
    "성북" => (61, 127),
    "성북구" => (61, 127),
    "강북" => (61, 128),
    "강북구" => (61, 128),
    "도봉" => (61, 129),
    "도봉구" => (61, 129),
    "노원" => (61, 129),
    "노원구" => (61, 129),
    "은평" => (59, 127),
    "은평구" => (59, 127),
    "서대문" => (59, 127),
    "마포" => (59, 126),
    "마포구" => (59, 126),
    "양천" => (58, 126),
    "양천구" => (58, 126),
    "강서" => (58, 126),
    "강서구" => (58, 126),
    "구로" => (58, 125),
    "구로구" => (58, 125),
    "금천" => (59, 124),
    "금천구" => (59, 124),
    "영등포" => (58, 126),
    "영등포구" => (58, 126),
    "동작" => (59, 125),
    "동작구" => (59, 125),
    "관악" => (59, 125),
    "관악구" => (59, 125),
    "서초" => (61, 125),
    "서초구" => (61, 125),
    "강남" => (61, 126),
    "강남구" => (61, 126),
    "송파" => (62, 126),
    "송파구" => (62, 126),
    "강동" => (62, 126),
    "강동구" => (62, 126),
    "서울특별시" => (60, 127),
    "서울시" => (60, 127),
    "서울" => (60, 127),

    "부산광역시중구" => (97, 74),
    "부산중구" => (97, 74),
    "부산광역시중" => (97, 74),
    "부산광역시서구" => (97, 74),
    "부산서구" => (97, 74),
    "부산광역시서" => (97, 74),
    "부산광역시동구" => (98, 75),
    "부산동구" => (98, 75),
    "부산광역시동" => (98, 75),
    "부산광역시영도구" => (98, 74),
    "부산광역시영도" => (98, 74),
    "부산영도구" => (98, 74),
    "부산광역시부산진구" => (97, 75),
    "부산부산진구" => (97, 75),
    "부산광역시부산진" => (97, 75),
    "부산광역시동래" => (98, 76),
    "부산광역시동래구" => (98, 76),
    "부산동래구" => (98, 76),
    "부산남구" => (98, 75),
    "부산광역시남" => (98, 75),
    "부산광역시남구" => (98, 75),
    "부산광역시북구" => (96, 76),
    "부산북구" => (96, 76),
    "부산광역시북" => (96, 76),
    "부산광역시해운대" => (99, 75),
    "부산해운대구" => (99, 75),
    "부산광역시해운대구" => (99, 75),
    "부산광역시사하" => (96, 74),
    "부산광역시사하구" => (96, 74),
    "부산사하구" => (96, 74),
    "부산광역시금정" => (98, 77),
    "부산금정구" => (98, 77),
    "부산광역시금정구" => (98, 77),
    "부산광역시강서" => (96, 76),
    "부산강서구" => (96, 76),
    "부산광역시강서구" => (96, 76),
    "부산광역시연제" => (98, 76),
    "부산광역시연제구" => (98, 76),
    "부산연제구" => (98, 76),
    "부산수영구" => (99, 75),
    "부산광역시수영" => (99, 75),
    "부산광역시수영구" => (99, 75),
    "부산사상구" => (96, 75),
    "부산광역시사상구" => (96, 75),
    "부산광역시사상" => (96, 75),
    "부산광역시기장군" => (100, 77),
    "부산기장군" => (100, 77),
    "부산광역시" => (98, 76),
    "부산시" => (98, 76),
    "부산" => (98, 76),

    "대구중구" => (89, 90),
    "대구광역시중구" => (89, 90),
    "대구광역시동구" => (90, 91),
    "대구동구" => (90, 91),
    "대구서구" => (88, 90),
    "대구광역시서구" => (88, 90),
    "대구광역시서" => (88, 90),
    "대구남구" => (89, 90),
    "대구광역시남구" => (89, 90),
    "대구광역시남" => (89, 90),
    "대구북구" => (89, 91),
    "대구광역시북구" => (89, 91),
    "대구광역시북" => (89, 91),
    "대구수성구" => (89, 90),
    "대구광역시수성" => (89, 90),
    "대구광역시수성구" => (89, 90),
    "대구달서구" => (88, 90),
    "대구광역시달서구" => (88, 90),
    "대구광역시달서" => (88, 90),
    "대구광역시달성군" => (86, 88),
    "대구달성군" => (86, 88),
    "대구광역시군위군" => (88, 99),
    "대구군위군" => (88, 99),
    "대구광역시"=> (89, 90),
    "대구시"=> (89, 90),
    "대구" => (89, 90),

    "인천광역시중구" => (54, 125),
    "인천중구" => (54, 125),
    "인천광역시동구" => (54, 125),
    "인천동구" => (54, 125),
    "인천광역시미추홀" => (54, 124),
    "인천광역시미추홀구" => (54, 124),
    "인천미추홀구" => (54, 124),
    "인천광역시연수" => (55, 123),
    "인천연수구" => (55, 123),
    "인천광역시연수구" => (55, 123),
    "인천광역시남동구" => (56, 124),
    "인천남동구" => (56, 124),
    "인천광역시남동" => (56, 124),
    "인천부평구" => (55, 125),
    "인천광역시부평구" => (55, 125),
    "인천광역시부평" => (55, 125),
    "인천광역시계양" => (56, 126),
    "인천계양구" => (56, 126),
    "인천광역시계양구" => (56, 126),
    "인천광역시서구" => (55, 126),
    "인천서구" => (55, 126),
    "인천광역시강화군" => (51, 130),
    "인천강화군" => (51, 130),
    "인천옹진군" => (54, 124),
    "인천광역시옹진군" => (54, 124),
    "인천광역시" => (55, 124),
    "인천시" => (55, 124),
    "인천" => (55, 124),
    
    "광주동구" => (60, 74),
    "광주광역시동구" => (60, 74),
    "광주서구" => (59, 74),
    "광주광역시서구" => (59, 74),
    "광주광역시남구" => (59, 73),
    "광주남구" => (59, 73),
    "광주북구" => (59, 75),
    "광주광역시북구" => (59, 75),
    "광주광역시광산" => (57, 74),
    "광주광역시광산구" => (57, 74),
    "광주광역시" => (58, 74),
    "광주시" => (58, 74),
    "광주" => (58, 74),

    "대전광역시동구" => (68, 100),
    "대전동구" => (68, 100),
    "대전중구" => (68, 100),
    "대전광역시중구" => (68, 100),
    "대전광역시중" => (68, 100),
    "대전광역시서구" => (67, 100),
    "대전광역시서" => (67, 100),
    "대전서구" => (67, 100),
    "대전유성구" => (67, 101),
    "대전광역시유성구" => (67, 101),
    "대전광역시유성" => (67, 101),
    "대전광역시대덕구" => (68, 100),
    "대전광역시대덕" => (68, 100),
    "대전대덕구" => (68, 100),
    "대전광역시동" => (68, 100),
    "대전광역시" => (67, 100),
    "대전" => (67, 100),

    "울산중구" => (102, 84),
    "울산광역시중구" => (102, 84),
    "울산남구" => (102, 84),
    "울산광역시남구" => (102, 84),
    "울산광역시동구" => (104, 83),
    "울산동구" => (104, 83),
    "울산북구" => (103, 85),
    "울산광역시북구" => (103, 85),
    "울산울주군" => (101, 84),
    "울산광역시울주군" => (101, 84),
    "울산광역시" => (102, 84),
    "울산" => (102, 84),

    "세종특별자치시" => (66, 103),
    "세종시" => (66, 103),
    "세종" => (66, 103),

    "수원시" => (60, 121),
    "수원" => (60, 121),
    "성남시" => (63, 124),
    "성남" => (63, 124),
    "의정부시" => (61, 130),
    "의정부" => (61, 130),
    "안양시" => (59, 123),
    "안양" => (59, 123),
    "부천시" => (57, 125),
    "부천" => (57, 125),
    "광명시" => (58, 125),
    "광명" => (58, 125),
    "평택시" => (62, 114),
    "평택" => (62, 114),
    "동두천시" => (61, 134),
    "동두천" => (61, 134),
    "안산시" => (57, 121),
    "안산" => (57, 121),
    "고양시" => (57, 128),
    "고양" => (57, 128),
    "과천시" => (60, 124),
    "과천" => (60, 124),
    "구리시" => (62, 127),
    "구리" => (62, 127),
    "남양주시" => (64, 128),
    "남양주" => (64, 128),
    "오산시" => (62, 118),
    "오산" => (62, 118),
    "시흥시" => (57, 123),
    "시흥" => (57, 123),
    "군포시" => (59, 122),
    "군포" => (59, 122),
    "의왕시" => (60, 122),
    "의왕" => (60, 122),
    "하남시" => (64, 126),
    "하남" => (64, 126),
    "용인시" => (64, 119),
    "용인" => (64, 119),
    "파주시" => (56, 131),
    "파주" => (56, 131),
    "이천시" => (68, 121),
    "이천" => (68, 121),
    "안성시" => (65, 115),
    "안성" => (65, 115),
    "김포시" => (55, 128),
    "김포" => (55, 128),
    "화성시" => (57, 119),
    "화성" => (57, 119),
    "경기도광주시" => (65, 123),
    "경기도광주" => (65, 123),
    "경기광주시" => (65, 123),
    "경기광주" => (65, 123),
    "양주시" => (61, 131),
    "양주" => (61, 131),
    "포천시" => (64, 134),
    "포천" => (64, 134),
    "여주시" => (71, 121),
    "여주" => (71, 121),
    "연천군" => (61, 138),
    "연천" => (61, 138),
    "가평군" => (69, 133),
    "가평" => (69, 133),
    "양평군" => (69, 125),
    "양평" => (69, 125),
    "경기도" => (60, 120),

    "충청북도청주시" => (67, 106),
    "충청북도청주" => (67, 106),
    "청주시" => (67, 106),
    "청주" => (67, 106),
    "충북청주시" => (67, 106),
    "충북청주" => (67, 106),
    "충청북도충주시" => (76, 114),
    "충청북도충주" => (76, 114),
    "충주시" => (76, 114),
    "충주" => (76, 114),
    "충북충주시" => (76, 114),
    "충북충주" => (76, 114),
    "충청북도제천시" => (81, 118),
    "충청북도제천" => (81, 118),
    "제천시" => (81, 118),
    "제천" => (81, 118),
    "충북제천시" => (81, 118),
    "충북제천" => (81, 118),
    "충청북도보은군" => (73, 103),
    "충청북도보은" => (73, 103),
    "보은군" => (73, 103),
    "보은" => (73, 103),
    "충북보은군" => (73, 103),
    "충북보은" => (73, 103),
    "충청북도옥천군" => (71, 99),
    "충청북도옥천" => (71, 99),
    "옥천군" => (71, 99),
    "옥천" => (71, 99),
    "충북옥천군" => (71, 99),
    "충북옥천" => (71, 99),
    "충청북도영동군" => (74, 97),
    "충청북도영동" => (74, 97),
    "영동군" => (74, 97),
    "영동" => (74, 97),
    "충북영동군" => (74, 97),
    "충북영동" => (74, 97),
    "충청북도증평군" => (71, 110),
    "충청북도증평" => (71, 110),
    "증평군" => (71, 110),
    "증평" => (71, 110),
    "충북증평군" => (71, 110),
    "충북증평" => (71, 110),
    "충청북도진천군" => (68, 111),
    "충청북도진천" => (68, 111),
    "진천군" => (68, 111),
    "진천" => (68, 111),
    "충북진천군" => (68, 111),
    "충북진천" => (68, 111),
    "충청북도괴산군" => (74, 111),
    "충청북도괴산" => (74, 111),
    "괴산군" => (74, 111),
    "괴산" => (74, 111),
    "충북괴산군" => (74, 111),
    "충북괴산" => (74, 111),
    "충청북도음성군" => (72, 113),
    "충청북도음성" => (72, 113),
    "음성군" => (72, 113),
    "음성" => (72, 113),
    "충북음성군" => (72, 113),
    "충북음성" => (72, 113),
    "충청북도단양군" => (84, 115),
    "충청북도단양" => (84, 115),
    "단양군" => (84, 115),
    "단양" => (84, 115),
    "충북단양군" => (84, 115),
    "충북단양" => (84, 115),

    "충청남도천안시" => (63, 112),
    "충청남도천안" => (63, 112),
    "천안시" => (63, 112),
    "천안" => (63, 112),
    "충남천안시" => (63, 112),
    "충남천안" => (63, 112),
    "충청남도공주시" => (63, 102),
    "충청남도공주" => (63, 102),
    "공주시" => (63, 102),
    "공주" => (63, 102),
    "충남공주시" => (63, 102),
    "충남공주" => (63, 102),
    "충청남도보령시" => (54, 100),
    "충청남도보령" => (54, 100),
    "보령시" => (54, 100),
    "보령" => (54, 100),
    "충남보령시" => (54, 100),
    "충남보령" => (54, 100),
    "충청남도아산시" => (60, 110),
    "충청남도아산" => (60, 110),
    "아산시" => (60, 110),
    "아산" => (60, 110),
    "충남아산시" => (60, 110),
    "충남아산" => (60, 110),
    "충청남도서산시" => (51, 110),
    "충청남도서산" => (51, 110),
    "서산시" => (51, 110),
    "서산" => (51, 110),
    "충남서산시" => (51, 110),
    "충남서산" => (51, 110),
    "충청남도논산시" => (62, 97),
    "충청남도논산" => (62, 97),
    "논산시" => (62, 97),
    "논산" => (62, 97),
    "충남논산시" => (62, 97),
    "충남논산" => (62, 97),
    "충청남도계룡시" => (65, 99),
    "충청남도계룡" => (65, 99),
    "계룡시" => (65, 99),
    "계룡" => (65, 99),
    "충남계룡시" => (65, 99),
    "충남계룡" => (65, 99),
    "충청남도당진시" => (54, 112),
    "충청남도당진" => (54, 112),
    "당진시" => (54, 112),
    "당진" => (54, 112),
    "충남당진시" => (54, 112),
    "충남당진" => (54, 112),
    "충청남도금산군" => (69, 95),
    "충청남도금산" => (69, 95),
    "금산군" => (69, 95),
    "금산" => (69, 95),
    "충남금산군" => (69, 95),
    "충남금산" => (69, 95),
    "충청남도부여군" => (59, 99),
    "충청남도부여" => (59, 99),
    "부여군" => (59, 99),
    "부여" => (59, 99),
    "충남부여군" => (59, 99),
    "충남부여" => (59, 99),
    "충청남도서천군" => (55, 94),
    "충청남도서천" => (55, 94),
    "서천군" => (55, 94),
    "서천" => (55, 94),
    "충남서천군" => (55, 94),
    "충남서천" => (55, 94),
    "충청남도청양군" => (57, 103),
    "충청남도청양" => (57, 103),
    "청양군" => (57, 103),
    "청양" => (57, 103),
    "충남청양군" => (57, 103),
    "충남청양" => (57, 103),
    "충청남도홍성군" => (55, 106),
    "충청남도홍성" => (55, 106),
    "홍성군" => (55, 106),
    "홍성" => (55, 106),
    "충남홍성군" => (55, 106),
    "충남홍성" => (55, 106),
    "충청남도예산군" => (58, 107),
    "충청남도예산" => (58, 107),
    "예산군" => (58, 107),
    "예산" => (58, 107),
    "충남예산군" => (58, 107),
    "충남예산" => (58, 107),
    "충청남도태안군" => (48, 109),
    "충청남도태안" => (48, 109),
    "태안군" => (48, 109),
    "태안" => (48, 109),
    "충남태안군" => (48, 109),
    "충남태안" => (48, 109),

    "전라남도목포시" => (50, 67),
    "전라남도목포" => (50, 67),
    "목포시" => (50, 67),
    "목포" => (50, 67),
    "전남목포시" => (50, 67),
    "전남목포" => (50, 67),
    "전라남도여수시" => (73, 66),
    "전라남도여수" => (73, 66),
    "여수시" => (73, 66),
    "여수" => (73, 66),
    "전남여수시" => (73, 66),
    "전남여수" => (73, 66),
    "전라남도순천시" => (70, 70),
    "전라남도순천" => (70, 70),
    "순천시" => (70, 70),
    "순천" => (70, 70),
    "전남순천시" => (70, 70),
    "전남순천" => (70, 70),
    "전라남도나주시" => (56, 71),
    "전라남도나주" => (56, 71),
    "나주시" => (56, 71),
    "나주" => (56, 71),
    "전남나주시" => (56, 71),
    "전남나주" => (56, 71),
    "전라남도광양시" => (73, 70),
    "전라남도광양" => (73, 70),
    "광양시" => (73, 70),
    "광양" => (73, 70),
    "전남광양시" => (73, 70),
    "전남광양" => (73, 70),
    "전라남도담양군" => (61, 78),
    "전라남도담양" => (61, 78),
    "담양군" => (61, 78),
    "담양" => (61, 78),
    "전남담양군" => (61, 78),
    "전남담양" => (61, 78),
    "전라남도곡성군" => (66, 77),
    "전라남도곡성" => (66, 77),
    "곡성군" => (66, 77),
    "곡성" => (66, 77),
    "전남곡성군" => (66, 77),
    "전남곡성" => (66, 77),
    "전라남도례군" => (69, 75),
    "전라남도례" => (69, 75),
    "례군" => (69, 75),
    "례" => (69, 75),
    "전남례군" => (69, 75),
    "전남례" => (69, 75),
    "전라남도구례군" => (69, 75),
    "전라남도구례" => (69, 75),
    "구례군" => (69, 75),
    "구례" => (69, 75),
    "전남구례군" => (69, 75),
    "전남구례" => (69, 75),
    "전라남도고흥군" => (66, 62),
    "전라남도고흥" => (66, 62),
    "고흥군" => (66, 62),
    "고흥" => (66, 62),
    "전남고흥군" => (66, 62),
    "전남고흥" => (66, 62),
    "전라남도보성군" => (62, 66),
    "전라남도보성" => (62, 66),
    "보성군" => (62, 66),
    "보성" => (62, 66),
    "전남보성군" => (62, 66),
    "전남보성" => (62, 66),
    "전라남도화순군" => (61, 72),
    "전라남도화순" => (61, 72),
    "화순군" => (61, 72),
    "화순" => (61, 72),
    "전남화순군" => (61, 72),
    "전남화순" => (61, 72),
    "전라남도장흥군" => (59, 64),
    "전라남도장흥" => (59, 64),
    "장흥군" => (59, 64),
    "장흥" => (59, 64),
    "전남장흥군" => (59, 64),
    "전남장흥" => (59, 64),
    "전라남도강진군" => (57, 63),
    "전라남도강진" => (57, 63),
    "강진군" => (57, 63),
    "강진" => (57, 63),
    "전남강진군" => (57, 63),
    "전남강진" => (57, 63),
    "전라남도해남군" => (54, 61),
    "전라남도해남" => (54, 61),
    "해남군" => (54, 61),
    "해남" => (54, 61),
    "전남해남군" => (54, 61),
    "전남해남" => (54, 61),
    "전라남도영암군" => (56, 66),
    "전라남도영암" => (56, 66),
    "영암군" => (56, 66),
    "영암" => (56, 66),
    "전남영암군" => (56, 66),
    "전남영암" => (56, 66),
    "전라남도무안군" => (52, 71),
    "전라남도무안" => (52, 71),
    "무안군" => (52, 71),
    "무안" => (52, 71),
    "전남무안군" => (52, 71),
    "전남무안" => (52, 71),
    "전라남도함평군" => (52, 72),
    "전라남도함평" => (52, 72),
    "함평군" => (52, 72),
    "함평" => (52, 72),
    "전남함평군" => (52, 72),
    "전남함평" => (52, 72),
    "전라남도영광군" => (52, 77),
    "전라남도영광" => (52, 77),
    "영광군" => (52, 77),
    "영광" => (52, 77),
    "전남영광군" => (52, 77),
    "전남영광" => (52, 77),
    "전라남도장성군" => (57, 77),
    "전라남도장성" => (57, 77),
    "장성군" => (57, 77),
    "장성" => (57, 77),
    "전남장성군" => (57, 77),
    "전남장성" => (57, 77),
    "전라남도완도군" => (57, 56),
    "전라남도완도" => (57, 56),
    "완도군" => (57, 56),
    "완도" => (57, 56),
    "전남완도군" => (57, 56),
    "전남완도" => (57, 56),
    "전라남도진도군" => (48, 59),
    "전라남도진도" => (48, 59),
    "진도군" => (48, 59),
    "진도" => (48, 59),
    "전남진도군" => (48, 59),
    "전남진도" => (48, 59),
    "전라남도신안군" => (50, 66),
    "전라남도신안" => (50, 66),
    "신안군" => (50, 66),
    "신안" => (50, 66),
    "전남신안군" => (50, 66),
    "전남신안" => (50, 66),

    "경상북도포항시" => (102, 95),
    "경상북도포항" => (102, 95),
    "포항시" => (102, 95),
    "포항" => (102, 95),
    "경북포항시" => (102, 95),
    "경북포항" => (102, 95),
    "경상북도경주시" => (100, 91),
    "경상북도경주" => (100, 91),
    "경주시" => (100, 91),
    "경주" => (100, 91),
    "경북경주시" => (100, 91),
    "경북경주" => (100, 91),
    "경상북도김천시" => (80, 96),
    "경상북도김천" => (80, 96),
    "김천시" => (80, 96),
    "김천" => (80, 96),
    "경북김천시" => (80, 96),
    "경북김천" => (80, 96),
    "경상북도안동시" => (91, 106),
    "경상북도안동" => (91, 106),
    "안동시" => (91, 106),
    "안동" => (91, 106),
    "경북안동시" => (91, 106),
    "경북안동" => (91, 106),
    "경상북도미시" => (84, 96),
    "경상북도미" => (84, 96),
    "미시" => (84, 96),
    "미" => (84, 96),
    "경북미시" => (84, 96),
    "경북미" => (84, 96),
    "경상북도구미시" => (84, 96),
    "경상북도구미" => (84, 96),
    "구미시" => (84, 96),
    "구미" => (84, 96),
    "경북구미시" => (84, 96),
    "경북구미" => (84, 96),
    "경상북도영주시" => (89, 111),
    "경상북도영주" => (89, 111),
    "영주시" => (89, 111),
    "영주" => (89, 111),
    "경북영주시" => (89, 111),
    "경북영주" => (89, 111),
    "경상북도영천시" => (95, 93),
    "경상북도영천" => (95, 93),
    "영천시" => (95, 93),
    "영천" => (95, 93),
    "경북영천시" => (95, 93),
    "경북영천" => (95, 93),
    "경상북도상주시" => (81, 102),
    "경상북도상주" => (81, 102),
    "상주시" => (81, 102),
    "상주" => (81, 102),
    "경북상주시" => (81, 102),
    "경북상주" => (81, 102),
    "경상북도문경시" => (81, 106),
    "경상북도문경" => (81, 106),
    "문경시" => (81, 106),
    "문경" => (81, 106),
    "경북문경시" => (81, 106),
    "경북문경" => (81, 106),
    "경상북도경산시" => (91, 90),
    "경상북도경산" => (91, 90),
    "경산시" => (91, 90),
    "경산" => (91, 90),
    "경북경산시" => (91, 90),
    "경북경산" => (91, 90),
    "경상북도의성군" => (90, 101),
    "경상북도의성" => (90, 101),
    "의성군" => (90, 101),
    "의성" => (90, 101),
    "경북의성군" => (90, 101),
    "경북의성" => (90, 101),
    "경상북도청송군" => (96, 103),
    "경상북도청송" => (96, 103),
    "청송군" => (96, 103),
    "청송" => (96, 103),
    "경북청송군" => (96, 103),
    "경북청송" => (96, 103),
    "경상북도영양군" => (97, 108),
    "경상북도영양" => (97, 108),
    "영양군" => (97, 108),
    "영양" => (97, 108),
    "경북영양군" => (97, 108),
    "경북영양" => (97, 108),
    "경상북도영덕군" => (102, 103),
    "경상북도영덕" => (102, 103),
    "영덕군" => (102, 103),
    "영덕" => (102, 103),
    "경북영덕군" => (102, 103),
    "경북영덕" => (102, 103),
    "경상북도청도군" => (91, 86),
    "경상북도청도" => (91, 86),
    "청도군" => (91, 86),
    "청도" => (91, 86),
    "경북청도군" => (91, 86),
    "경북청도" => (91, 86),
    "경상북도고령군" => (83, 87),
    "경상북도고령" => (83, 87),
    "고령군" => (83, 87),
    "고령" => (83, 87),
    "경북고령군" => (83, 87),
    "경북고령" => (83, 87),
    "경상북도성주군" => (83, 91),
    "경상북도성주" => (83, 91),
    "성주군" => (83, 91),
    "성주" => (83, 91),
    "경북성주군" => (83, 91),
    "경북성주" => (83, 91),
    "경상북도칠곡군" => (85, 93),
    "경상북도칠곡" => (85, 93),
    "칠곡군" => (85, 93),
    "칠곡" => (85, 93),
    "경북칠곡군" => (85, 93),
    "경북칠곡" => (85, 93),
    "경상북도예천군" => (86, 107),
    "경상북도예천" => (86, 107),
    "예천군" => (86, 107),
    "예천" => (86, 107),
    "경북예천군" => (86, 107),
    "경북예천" => (86, 107),
    "경상북도봉화군" => (90, 113),
    "경상북도봉화" => (90, 113),
    "봉화군" => (90, 113),
    "봉화" => (90, 113),
    "경북봉화군" => (90, 113),
    "경북봉화" => (90, 113),
    "경상북도울진군" => (102, 115),
    "경상북도울진" => (102, 115),
    "울진군" => (102, 115),
    "울진" => (102, 115),
    "경북울진군" => (102, 115),
    "경북울진" => (102, 115),
    "경상북도울릉군" => (127, 127),
    "경상북도울릉" => (127, 127),
    "울릉군" => (127, 127),
    "울릉" => (127, 127),
    "울릉도" => (127, 127),
    "경북울릉군" => (127, 127),
    "경북울릉" => (127, 127),

    "경상남도창원시" => (90, 77),
    "경상남도창원" => (90, 77),
    "창원시" => (90, 77),
    "창원" => (90, 77),
    "경남창원시" => (90, 77),
    "경남창원" => (90, 77),
    "경상남도진주시" => (81, 75),
    "경상남도진주" => (81, 75),
    "진주시" => (81, 75),
    "진주" => (81, 75),
    "경남진주시" => (81, 75),
    "경남진주" => (81, 75),
    "경상남도통영시" => (87, 68),
    "경상남도통영" => (87, 68),
    "통영시" => (87, 68),
    "통영" => (87, 68),
    "경남통영시" => (87, 68),
    "경남통영" => (87, 68),
    "경상남도사천시" => (80, 71),
    "경상남도사천" => (80, 71),
    "사천시" => (80, 71),
    "사천" => (80, 71),
    "경남사천시" => (80, 71),
    "경남사천" => (80, 71),
    "경상남도김해시" => (95, 77),
    "경상남도김해" => (95, 77),
    "김해시" => (95, 77),
    "김해" => (95, 77),
    "경남김해시" => (95, 77),
    "경남김해" => (95, 77),
    "경상남도밀양시" => (92, 83),
    "경상남도밀양" => (92, 83),
    "밀양시" => (92, 83),
    "밀양" => (92, 83),
    "경남밀양시" => (92, 83),
    "경남밀양" => (92, 83),
    "경상남도거제시" => (90, 69),
    "경상남도거제" => (90, 69),
    "거제시" => (90, 69),
    "거제" => (90, 69),
    "경남거제시" => (90, 69),
    "경남거제" => (90, 69),
    "경상남도양산시" => (97, 79),
    "경상남도양산" => (97, 79),
    "양산시" => (97, 79),
    "양산" => (97, 79),
    "경남양산시" => (97, 79),
    "경남양산" => (97, 79),
    "경상남도의령군" => (83, 78),
    "경상남도의령" => (83, 78),
    "의령군" => (83, 78),
    "의령" => (83, 78),
    "경남의령군" => (83, 78),
    "경남의령" => (83, 78),
    "경상남도함안군" => (86, 77),
    "경상남도함안" => (86, 77),
    "함안군" => (86, 77),
    "함안" => (86, 77),
    "경남함안군" => (86, 77),
    "경남함안" => (86, 77),
    "경상남도창녕군" => (87, 83),
    "경상남도창녕" => (87, 83),
    "창녕군" => (87, 83),
    "창녕" => (87, 83),
    "경남창녕군" => (87, 83),
    "경남창녕" => (87, 83),
    "경상남도고성군" => (85, 71),
    "경상남도고성" => (85, 71),
    "경남고성군" => (85, 71),
    "경남고성" => (85, 71),
    "경상남도남해군" => (77, 68),
    "경상남도남해" => (77, 68),
    "남해군" => (77, 68),
    "남해" => (77, 68),
    "경남남해군" => (77, 68),
    "경남남해" => (77, 68),
    "경상남도하동군" => (74, 73),
    "경상남도하동" => (74, 73),
    "하동군" => (74, 73),
    "하동" => (74, 73),
    "경남하동군" => (74, 73),
    "경남하동" => (74, 73),
    "경상남도산청군" => (76, 80),
    "경상남도산청" => (76, 80),
    "산청군" => (76, 80),
    "산청" => (76, 80),
    "경남산청군" => (76, 80),
    "경남산청" => (76, 80),
    "경상남도함양군" => (74, 82),
    "경상남도함양" => (74, 82),
    "함양군" => (74, 82),
    "함양" => (74, 82),
    "경남함양군" => (74, 82),
    "경남함양" => (74, 82),
    "경상남도거창군" => (77, 86),
    "경상남도거창" => (77, 86),
    "거창군" => (77, 86),
    "거창" => (77, 86),
    "경남거창군" => (77, 86),
    "경남거창" => (77, 86),
    "경상남도합천군" => (81, 84),
    "경상남도합천" => (81, 84),
    "합천군" => (81, 84),
    "합천" => (81, 84),
    "경남합천군" => (81, 84),
    "경남합천" => (81, 84),

    "제주특별자치도" => (52, 38),
    "제주특별자치도제주시" => (53, 38),
    "제주특별자치도서귀포시" => (52, 33),
    "제주" => (52, 38),
    "제주시" => (53, 38),
    "서귀포" => (52, 33),
    "제주도" => (52, 38),
    "제주서귀포" => (53, 38),

    "이어도" => (28, 8),

    "강원특별자치도춘천시" => (73, 134),
    "강원특별자치도춘천" => (73, 134),
    "춘천시" => (73, 134),
    "춘천" => (73, 134),
    "강원춘천시" => (73, 134),
    "강원춘천" => (73, 134),
    "강원도춘천시" => (73, 134),
    "강원도춘천" => (73, 134),
    "강원특별자치도원주시" => (76, 122),
    "강원특별자치도원주" => (76, 122),
    "원주시" => (76, 122),
    "원주" => (76, 122),
    "강원원주시" => (76, 122),
    "강원원주" => (76, 122),
    "강원도원주시" => (76, 122),
    "강원도원주" => (76, 122),
    "강원특별자치도강릉시" => (92, 131),
    "강원특별자치도강릉" => (92, 131),
    "강릉시" => (92, 131),
    "강릉" => (92, 131),
    "강원강릉시" => (92, 131),
    "강원강릉" => (92, 131),
    "강원도강릉시" => (92, 131),
    "강원도강릉" => (92, 131),
    "강원특별자치도동해시" => (97, 127),
    "강원특별자치도동해" => (97, 127),
    "동해시" => (97, 127),
    "동해" => (97, 127),
    "강원동해시" => (97, 127),
    "강원동해" => (97, 127),
    "강원도동해시" => (97, 127),
    "강원도동해" => (97, 127),
    "강원특별자치도태백시" => (95, 119),
    "강원특별자치도태백" => (95, 119),
    "태백시" => (95, 119),
    "태백" => (95, 119),
    "강원태백시" => (95, 119),
    "강원태백" => (95, 119),
    "강원도태백시" => (95, 119),
    "강원도태백" => (95, 119),
    "강원특별자치도속초시" => (87, 141),
    "강원특별자치도속초" => (87, 141),
    "속초시" => (87, 141),
    "속초" => (87, 141),
    "강원속초시" => (87, 141),
    "강원속초" => (87, 141),
    "강원도속초시" => (87, 141),
    "강원도속초" => (87, 141),
    "강원특별자치도삼척시" => (98, 125),
    "강원특별자치도삼척" => (98, 125),
    "삼척시" => (98, 125),
    "삼척" => (98, 125),
    "강원삼척시" => (98, 125),
    "강원삼척" => (98, 125),
    "강원도삼척시" => (98, 125),
    "강원도삼척" => (98, 125),
    "강원특별자치도홍천군" => (75, 130),
    "강원특별자치도홍천" => (75, 130),
    "홍천군" => (75, 130),
    "홍천" => (75, 130),
    "강원홍천군" => (75, 130),
    "강원홍천" => (75, 130),
    "강원도홍천군" => (75, 130),
    "강원도홍천" => (75, 130),
    "강원특별자치도횡성군" => (77, 125),
    "강원특별자치도횡성" => (77, 125),
    "횡성군" => (77, 125),
    "횡성" => (77, 125),
    "강원횡성군" => (77, 125),
    "강원횡성" => (77, 125),
    "강원도횡성군" => (77, 125),
    "강원도횡성" => (77, 125),
    "강원특별자치도영월군" => (86, 119),
    "강원특별자치도영월" => (86, 119),
    "영월군" => (86, 119),
    "영월" => (86, 119),
    "강원영월군" => (86, 119),
    "강원영월" => (86, 119),
    "강원도영월군" => (86, 119),
    "강원도영월" => (86, 119),
    "강원특별자치도평창군" => (84, 123),
    "강원특별자치도평창" => (84, 123),
    "평창군" => (84, 123),
    "평창" => (84, 123),
    "강원평창군" => (84, 123),
    "강원평창" => (84, 123),
    "강원도평창군" => (84, 123),
    "강원도평창" => (84, 123),
    "강원특별자치도정선군" => (89, 123),
    "강원특별자치도정선" => (89, 123),
    "정선군" => (89, 123),
    "정선" => (89, 123),
    "강원정선군" => (89, 123),
    "강원정선" => (89, 123),
    "강원도정선군" => (89, 123),
    "강원도정선" => (89, 123),
    "강원특별자치도철원군" => (65, 139),
    "강원특별자치도철원" => (65, 139),
    "철원군" => (65, 139),
    "철원" => (65, 139),
    "강원철원군" => (65, 139),
    "강원철원" => (65, 139),
    "강원도철원군" => (65, 139),
    "강원도철원" => (65, 139),
    "강원특별자치도화천군" => (72, 139),
    "강원특별자치도화천" => (72, 139),
    "화천군" => (72, 139),
    "화천" => (72, 139),
    "강원화천군" => (72, 139),
    "강원화천" => (72, 139),
    "강원도화천군" => (72, 139),
    "강원도화천" => (72, 139),
    "강원특별자치도양구군" => (77, 139),
    "강원특별자치도양구" => (77, 139),
    "양구군" => (77, 139),
    "양구" => (77, 139),
    "강원양구군" => (77, 139),
    "강원양구" => (77, 139),
    "강원도양구군" => (77, 139),
    "강원도양구" => (77, 139),
    "강원특별자치도양군" => (77, 139),
    "강원특별자치도양" => (77, 139),
    "양군" => (77, 139),
    "양" => (77, 139),
    "강원양군" => (77, 139),
    "강원양" => (77, 139),
    "강원도양군" => (77, 139),
    "강원도양" => (77, 139),
    "강원특별자치도인제군" => (80, 138),
    "강원특별자치도인제" => (80, 138),
    "인제군" => (80, 138),
    "인제" => (80, 138),
    "강원인제군" => (80, 138),
    "강원인제" => (80, 138),
    "강원도인제군" => (80, 138),
    "강원도인제" => (80, 138),
    "강원특별자치도고성군" => (85, 145),
    "강원특별자치도고성" => (85, 145),
    "강원고성군" => (85, 145),
    "강원고성" => (85, 145),
    "강원도고성군" => (85, 145),
    "강원도고성" => (85, 145),
    "강원특별자치도양양군" => (88, 138),
    "강원특별자치도양양" => (88, 138),
    "양양군" => (88, 138),
    "양양" => (88, 138),
    "강원양양군" => (88, 138),
    "강원양양" => (88, 138),
    "강원도양양군" => (88, 138),
    "강원도양양" => (88, 138),
    "강원특별자치도" => (73, 134),
    "강원" => (73, 134),
    "강원도" => (73, 134),

    "전북특별자치도전주시" => (63, 89),
    "전북특별자치도전주" => (63, 89),
    "전주시" => (63, 89),
    "전주" => (63, 89),
    "전북전주시" => (63, 89),
    "전북전주" => (63, 89),
    "전북특별자치도군산시" => (56, 92),
    "전북특별자치도군산" => (56, 92),
    "군산시" => (56, 92),
    "군산" => (56, 92),
    "전북군산시" => (56, 92),
    "전북군산" => (56, 92),
    "전북특별자치도익산시" => (60, 91),
    "전북특별자치도익산" => (60, 91),
    "익산시" => (60, 91),
    "익산" => (60, 91),
    "전북익산시" => (60, 91),
    "전북익산" => (60, 91),
    "전북특별자치도정읍시" => (58, 83),
    "전북특별자치도정읍" => (58, 83),
    "정읍시" => (58, 83),
    "정읍" => (58, 83),
    "전북정읍시" => (58, 83),
    "전북정읍" => (58, 83),
    "전북특별자치도남원시" => (68, 80),
    "전북특별자치도남원" => (68, 80),
    "남원시" => (68, 80),
    "남원" => (68, 80),
    "전북남원시" => (68, 80),
    "전북남원" => (68, 80),
    "전북특별자치도김제시" => (59, 88),
    "전북특별자치도김제" => (59, 88),
    "김제시" => (59, 88),
    "김제" => (59, 88),
    "전북김제시" => (59, 88),
    "전북김제" => (59, 88),
    "전북특별자치도완주군" => (63, 89),
    "전북특별자치도완주" => (63, 89),
    "완주군" => (63, 89),
    "완주" => (63, 89),
    "전북완주군" => (63, 89),
    "전북완주" => (63, 89),
    "전북특별자치도진안군" => (68, 88),
    "전북특별자치도진안" => (68, 88),
    "진안군" => (68, 88),
    "진안" => (68, 88),
    "전북진안군" => (68, 88),
    "전북진안" => (68, 88),
    "전북특별자치도무주군" => (72, 93),
    "전북특별자치도무주" => (72, 93),
    "무주군" => (72, 93),
    "무주" => (72, 93),
    "전북무주군" => (72, 93),
    "전북무주" => (72, 93),
    "전북특별자치도장수군" => (70, 85),
    "전북특별자치도장수" => (70, 85),
    "장수군" => (70, 85),
    "장수" => (70, 85),
    "전북장수군" => (70, 85),
    "전북장수" => (70, 85),
    "전북특별자치도임실군" => (66, 84),
    "전북특별자치도임실" => (66, 84),
    "임실군" => (66, 84),
    "임실" => (66, 84),
    "전북임실군" => (66, 84),
    "전북임실" => (66, 84),
    "전북특별자치도순창군" => (63, 79),
    "전북특별자치도순창" => (63, 79),
    "순창군" => (63, 79),
    "순창" => (63, 79),
    "전북순창군" => (63, 79),
    "전북순창" => (63, 79),
    "전북특별자치도고창군" => (56, 80),
    "전북특별자치도고창" => (56, 80),
    "고창군" => (56, 80),
    "고창" => (56, 80),
    "전북고창군" => (56, 80),
    "전북고창" => (56, 80),
    "전북특별자치도부안군" => (56, 87),
    "전북특별자치도부안" => (56, 87),
    "부안군" => (56, 87),
    "부안" => (56, 87),
    "전북부안군" => (56, 87),
    "전북부안" => (56, 87),
};

pub struct SpecialMessage {
    pub content: Option<String>,
    pub sticker_id: Option<u64>,
    pub embed: Option<CreateEmbed>,
    pub attachment: Option<CreateAttachment>,
    pub extra_note: String,
}
impl SpecialMessage {
    pub fn new() -> Self {
        Self {
            content: None,
            sticker_id: None,
            embed: None,
            attachment: None,
            extra_note: String::new(),
        }
    }
    
    pub fn content(mut self, content: impl Into<String>) -> Self {
        self.content = Some(content.into());
        self
    }

    pub fn sticker_id(mut self, id: u64) -> Self {
        self.sticker_id = Some(id);
        self
    }

    pub fn embed(mut self, embed: CreateEmbed) -> Self {
        self.embed = Some(embed);
        self
    }

    pub fn attachment(mut self, attachment: CreateAttachment) -> Self {
        self.attachment = Some(attachment);
        self
    }

    pub fn extra_note(mut self, note: impl Into<String>) -> Self {
        self.extra_note = note.into();
        self
    }

    pub fn content_to_extra(mut self) -> Self {
        if let Some(ref c) = self.content {
            self.extra_note = c.clone();
        }
        self
    }

    pub fn content_add_extra(mut self, extra: impl Into<String>) -> Self {
        if let Some(ref c) = self.content {
            self.extra_note = format!("{}{}", self.extra_note, c);
        }
        self.extra_note.push_str(&extra.into());
        self
    }


    pub fn to_create_message(&self) -> CreateMessage {
        let mut msg = CreateMessage::new();

        if let Some(content) = &self.content {
            msg = msg.content(content);
        }
        if let Some(sticker_id) = self.sticker_id {
            msg = msg.sticker_id(sticker_id);
        }
        if let Some(embed) = &self.embed {
            msg = msg.embed(embed.clone());
        }
        if let Some(attachment) = &self.attachment {
            msg = msg.add_file(attachment.clone());
        }

        msg
    }

    pub fn to_interaction_response(&self) -> CreateInteractionResponseMessage {
        let mut msg = CreateInteractionResponseMessage::new();

        if self.embed.is_some() {
            if let Some(embed) = &self.embed {
                msg = msg.embed(embed.clone());
            }
            if let Some(content) = &self.content {
                msg = msg.content(content);
            }
        } else if let Some(content) = &self.content {
            let embed = CreateEmbed::new()
                .description(content)
                .color(0xFFAAAA);
            msg = msg.embed(embed);
        }

        let msg = if let Some(attachment) = &self.attachment {
            msg.add_file(attachment.clone())
        } else {
            msg
        };

        msg
    }
}

pub async fn get_special_response(message: &str, ctx: &Context) -> Option<SpecialMessage> {
    let normalized_message = message.replace(&[' ', '?', '!', '.', ':', '-'][..], "");

    match normalized_message.as_str() {
        msg if W_FACE.iter().any(|&word| msg.contains(word)) => {
            Some(
                SpecialMessage::new()
                    .sticker_id(1296116499790168065)
                    .extra_note("*sticker_1296116499790168065*"))
        },
        msg if W_MIDDLE.iter().any(|&word| msg.contains(word)) => {
            Some(
                SpecialMessage::new()
                    .sticker_id(1296127617438711869)
                    .extra_note("*sticker_1296127617438711869*")
            )
        },

        msg if W_BLUEPRINT.iter().any(|&word| msg.contains(word)) => {
            let mut spmsg = SpecialMessage::new()
                .content("쉬운 비주얼 스크립팅 언어, Blueprint야. 코드 없이도 게임 로직을 구현할 수 있어")
                .content_add_extra(": *Blueprint_hi*");

            if let Ok(create_attachment) = CreateAttachment::url(
                &ctx.http,
                "https://cdn.discordapp.com/attachments/1270996130615922700/1356206035819302993/Blueprint_hi.png?ex=67ebb8cc&is=67ea674c&hm=df1cf4d441ee6cd9633adc24145e0e7083b52b2114b8187c51668514fd1c556b&"
            ).await {
                spmsg = spmsg.attachment(create_attachment);
            }

            Some(spmsg)
        },

        msg if W_WEATHER_KEYWORDS.iter().any(|&word| msg.contains(word)) => {
            for (name, &(nx, ny)) in &W_WEATHER_REGIONS {
                if normalized_message.contains(&name.to_uppercase()) {
                    let now = Local::now();
                    let base_date = now.format("%Y%m%d").to_string();
                    let base_time = format!("{:02}00", now.hour());

                    let url = format!(
                        "http://apis.data.go.kr/1360000/VilageFcstInfoService_2.0/getUltraSrtNcst?serviceKey={}\
                        &pageNo=1&numOfRows=100&dataType=JSON\
                        &base_date={}&base_time={}\
                        &nx={}&ny={}",
                        *WEATHER_KEY, base_date, base_time, nx, ny
                    );

                    match get(&url).await {
                        Ok(res) => {
                            match res.json::<Value>().await {
                                Ok(weather_data) => {
                                    let mut pty = None;
                                    let mut reh = None;
                                    let mut rn1 = None;
                                    let mut t1h = None;
                                    let mut vec = None;
                                    let mut wsd = None;

                                    if let Some(items) = weather_data["response"]["body"]["items"]["item"].as_array() {
                                        for item in items {
                                            if let (Some(category), Some(obsr_value)) = (
                                                item["category"].as_str(),
                                                item["obsrValue"].as_str(),
                                            ) {
                                                match category {
                                                    "PTY" => pty= Some(obsr_value),
                                                    "REH" => reh = Some(obsr_value),
                                                    "RN1" => rn1 = Some(obsr_value),
                                                    "T1H" => t1h = Some(obsr_value),
                                                    "VEC" => vec = obsr_value.parse::<i32>().ok(),
                                                    "WSD" => wsd = Some(obsr_value),
                                                    _ => {}
                                                }
                                            }
                                        }
                                    }

                                    let mut embed = CreateEmbed::new();
                                    let mut weather_info = String::new();

                                    if let Some(pty) = pty {
                                        let (desc, icon, col) = match pty {
                                            "0" => ("맑음", "☀️", 0x87CEEB),             // SkyBlue
                                            "1" => ("비", "🌧️", 0x4682B4),               // SteelBlue
                                            "2" => ("비/눈", "🌧️/❄️", 0x6A5ACD),         // SlateBlue
                                            "3" => ("눈", "❄️", 0xADD8E6),               // LightBlue
                                            "5" => ("빗방울", "🌦️", 0x5F9EA0),           // CadetBlue
                                            "6" => ("빗방울/눈날림", "🌦️/❄️", 0x7B68EE), // MediumSlateBlue
                                            "7" => ("눈날림", "❄️", 0xB0E0E6),           // PowderBlue
                                            _ => ("알수없음", "❓", 0xAAAAAA),
                                        };
                                        weather_info.push_str(&format!("> # {}\n## {}\n", icon, desc));
                                        embed = embed.color(col);
                                    }
                                    if let Some(v) = t1h {
                                        weather_info.push_str(&format!("기온 {}°C ", v));
                                    }
                                    if let Some(v) = reh {
                                        weather_info.push_str(&format!("습도 {}%\n", v));
                                    }
                                    if let Some(deg) = vec {
                                        let arrow = match deg {
                                            338..=359 | 0..=22 => "⬆️",
                                            23..=67 => "↗️",
                                            68..=112 => "➡️",
                                            113..=157 => "↘️",
                                            158..=202 => "⬇️",
                                            203..=247 => "↙️",
                                            248..=292 => "⬅️",
                                            293..=337 => "↖️",
                                            _ => "❓",
                                        };
                                        weather_info.push_str(&format!("**바람**: {} {}°\n", arrow, deg));
                                    }
                                    if let Some(v) = wsd {
                                        weather_info.push_str(&format!("**풍속**: {} m/s\n", v));
                                    }
                                    if let Some(v) = rn1 {
                                        weather_info.push_str(&format!("**최근 강수량**: {}mm\n", v));
                                    }
                                    if !weather_info.is_empty() {
                                        embed = embed.title(format!("{} >>", name)).description(weather_info);
                                        return Some(SpecialMessage::new().embed(embed).extra_note("*weather_info_now*"));
                                    }

                                    return Some(SpecialMessage::new().content("정보가 없어. 오류일 가능성이 높아").content_to_extra());
                                }
                                Err(e) => {
                                    println!("[ERROR] Weather API JSON: {:?}", e);
                                    return Some(SpecialMessage::new().content("데이터 처리 중에 오류가 났어").content_to_extra());
                                }
                            }
                        }
                        Err(e) => {
                            println!("[ERROR] Weather API JSON: {:?}", e);
                            return Some(SpecialMessage::new().content("API 요청 중에 오류가 났어").content_to_extra());
                        }
                    }
                }
            }

            return Some(SpecialMessage::new().content("지역명이 없어").content_to_extra());
        }

        _ => None,
    }
}